Workspace/03-dbns-shocktube/trash/03-roe-BarthJespersen/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
//EulerLocalDdtScheme  backwardDualDdtScheme  localTimeStep
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    dbns
    {
        flux         roe ; rusanov;
//betaFlux  hllcALEFlux  hllcFlux  roeFlux  rusanovFlux
        limiter        BarthJespersen;
//BarthJespersenLimiter.H  VenkatakrishnanLimiter.H
//MichalakGoochLimiter.H	 WangLimiter.H
//MDLimiter.H  firstOrderLimiter.H
    }
}

laplacianSchemes
{}

interpolationSchemes
{
   // default               none;
   // interpolate(rho)      linear;
    default         linear;
    reconstruct(rho) Minmod;
    reconstruct(U)  Minmod;
    reconstruct(T) Minmod;
}

snGradSchemes
{}


// ************************************************************************* //
